YaxUnit/DataProcessors/АнализРасширенияПриОбновлении.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>АнализРасширенияПриОбновлении</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПрограммаПросмотраИзменений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКGitMerge</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьДоKDiff3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьДоP4Merge</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыКоманднойСтроки2ФайлаKDiff3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыКоманднойСтроки2ФайлаP4Merge</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыКоманднойСтроки3ФайлаKDiff3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыКоманднойСтроки3ФайлаP4Merge</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

YaxUnit/DataProcessors/АнализРасширенияПриОбновлении/Ext/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
 
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
 
#Область ПрограммныйИнтерфейс
 
// Возвращает сведения о внешней обработке.
//
// Возвращаемое значение:
//   Структура - Подробнее см. ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке().
//
Функция СведенияОВнешнейОбработке() Экспорт
  // BSLLS:UsingHardcodeNetworkAddress-off
   ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("3.1.7.190");
   // BSLLS:UsingHardcodeNetworkAddress-off
   
   ПараметрыРегистрации.Информация = НСтр("ru = '" + Метаданные().Синоним + "'");
   ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
   ПараметрыРегистрации.Версия = ВерсияОбработки();
   ПараметрыРегистрации.БезопасныйРежим = Истина;
   
   Команда = ПараметрыРегистрации.Команды.Добавить();
   Команда.Представление =  НСтр("ru = '" + Метаданные().Синоним + "'");
   Команда.Идентификатор =  Метаданные().Имя;
   Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
   Команда.ПоказыватьОповещение = Истина;
       
   Возврат ПараметрыРегистрации;
КонецФункции
 
#КонецОбласти
 
#Область СлужебныеПроцедурыИФункции
Функция ВерсияОбработки() Экспорт
  	Возврат "2.0.0.1";	 
 КонецФункции

Функция НастройкиСравнения() Экспорт
	Результат = Новый Структура;    
	РеквизитыОбработки = Метаданные().Реквизиты;
	Для каждого Реквизит Из РеквизитыОбработки Цикл
		Результат.Вставить(Реквизит.Имя);	
	КонецЦикла;
	Возврат Результат;
КонецФункции

Процедура ЗаполнитьНастройкиПоУмолчанию(НужноОбновитьФорму = Истина) Экспорт 
	
	// BSLLS:LineLength-off
	Если Не ЗначениеЗаполнено(ПараметрыКоманднойСтроки2ФайлаKDiff3) Тогда   
		НужноОбновитьФорму = Истина;
		ПараметрыКоманднойСтроки2ФайлаKDiff3	 = 
		"[СтараяКонфигурация] [Расширение]  --L1 [ЗаголовокСтарая] --L2 [ЗаголовокРасширение]";
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПараметрыКоманднойСтроки2ФайлаP4Merge) Тогда
		НужноОбновитьФорму = Истина;
		ПараметрыКоманднойСтроки2ФайлаP4Merge  = 
		"-C utf8-bom -dw -nl [ЗаголовокСтарая] -nr [ЗаголовокРасширение]  [СтараяКонфигурация] [Расширение]";
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПараметрыКоманднойСтроки3ФайлаKDiff3) Тогда
		НужноОбновитьФорму = Истина;
		ПараметрыКоманднойСтроки3ФайлаKDiff3	 = 
		"[СтараяКонфигурация] [Расширение] [НоваяКонфигурация] -m --L1 [ЗаголовокСтарая] --L2 [ЗаголовокРасширение] --L3 [ЗаголовокНовая]";
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПараметрыКоманднойСтроки3ФайлаP4Merge) Тогда
		НужноОбновитьФорму = Истина;
		ПараметрыКоманднойСтроки3ФайлаP4Merge	 =
		"-C utf8-bom -dw -nb [ЗаголовокСтарая] -nl [ЗаголовокРасширение] -nr [ЗаголовокНовая] [СтараяКонфигурация] [Расширение] [НоваяКонфигурация] ";
	КонецЕсли; 
	// BSLLS:LineLength-on
КонецПроцедуры

 #КонецОбласти

#КонецЕсли
